app/Models/ModelSekolah.php

SELECT *
FROM `tbl_sekolah`
LEFT JOIN `tbl_jenjang` ON `tbl_jenjang`.`id_jenjang` = `tbl_sekolah`.`id_jenjang`
---
    public function AllData()
    {
        return $this->db->table('tbl_sekolah')
            ->join('tbl_jenjang', 'tbl_jenjang.id_jenjang = tbl_sekolah.id_jenjang', 'left')
            ->get()->getResultArray();

SELECT *
FROM `tbl_sekolah`
LEFT JOIN `tbl_jenjang` ON `tbl_jenjang`.`id_jenjang` = `tbl_sekolah`.`id_jenjang`
WHERE `id_wilayah` = '2'
---
    public function AllDataWilayah($id_wilayah)
    {
        return $this->db->table('tbl_sekolah')
            ->join('tbl_jenjang', 'tbl_jenjang.id_jenjang = tbl_sekolah.id_jenjang', 'left')
            ->where('id_wilayah', $id_wilayah)
            ->get()->getResultArray();

SELECT *
FROM `tbl_sekolah`
LEFT JOIN `tbl_jenjang` ON `tbl_jenjang`.`id_jenjang` = `tbl_sekolah`.`id_jenjang`
LEFT JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten` = `tbl_sekolah`.`id_kabupaten`
LEFT JOIN `tbl_provinsi` ON `tbl_provinsi`.`id_provinsi` = `tbl_sekolah`.`id_provinsi`
LEFT JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kecamatan` = `tbl_sekolah`.`id_kecamatan`
LEFT JOIN `tbl_wilayah` ON `tbl_wilayah`.`id_wilayah` = `tbl_sekolah`.`id_wilayah`
WHERE `id_sekolah` = '1'
---
    public function DetailData($id_sekolah)
    {
        return $this->db->table('tbl_sekolah')
            ->join('tbl_jenjang', 'tbl_jenjang.id_jenjang = tbl_sekolah.id_jenjang', 'left')
            ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten = tbl_sekolah.id_kabupaten', 'left')
            ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi = tbl_sekolah.id_provinsi', 'left')
            ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan = tbl_sekolah.id_kecamatan', 'left')
            ->join('tbl_wilayah', 'tbl_wilayah.id_wilayah = tbl_sekolah.id_wilayah', 'left')
            ->where('id_sekolah', $id_sekolah)
            ->get()->getRowArray();

UPDATE `tbl_sekolah` SET `id_sekolah` = '42', `nama_sekolah` = 'Tk Nurul Hafizah', `akreditasi` = 'C', `status` = 'Swasta', `coordinat` = '2.9864559657762384,99.67667251825334', `id_jenjang` = '1', `kepsek` = 'RISANTONO', `kurikulum` = 'Kurikulum Merdeka', `npsn` = '69755760', `stts_pemilik` = 'Yayasan', `alamat` = ' GG. KELUARGA LK. I SIUMBUT-UMBUT, Siumbut - Umbut, Kec. Kisaran Timur, Kab. Asahan Prov. Sumatera Utara'
WHERE `id_sekolah` = '42'
---
    public function UpdateData($data)
    {
        $this->db->table('tbl_sekolah')->where('id_sekolah', $data['id_sekolah'])->update($data);

SELECT *
FROM `tbl_provinsi`
ORDER BY `id_provinsi` ASC
---
    public function allProvinsi()
    {
        return $this->db->table('tbl_provinsi')->orderBy('id_provinsi', 'ASC')->get()->getResultArray();