app/Models/ModelWilayah.php

    public function AllData()
    {
        return $this->db->table('tbl_wilayah')->get()->getResultArray();
---
SELECT *
FROM `tbl_wilayah`

    public function DetailData($id_wilayah)
    {
        return $this->db->table('tbl_wilayah')->where('id_wilayah', $id_wilayah)->get()->getRowArray();
---
SELECT *
FROM `tbl_wilayah`
WHERE `id_wilayah` = '2'