app/Models/ModelSetting.php

SELECT *
FROM `tbl_settings`
WHERE `id` = 1
---
    public function Dataweb()
    {
        return $this->db->table('tbl_settings')->where('id', 1)->get()->getRowArray();