app/Models/ModelUser.php

    public function AllData()
    {
        return $this->db->table('tbl_user')->get()->getResultArray();
---
SELECT *
FROM `tbl_user`

    public function DetailData($id_user)
    {
        return $this->db->table('tbl_user')
            ->where('id_user', $id_user)
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `id_user` = '1'