app/Models/ModelAdmin.php

SELECT COUNT(*) AS `numrows` FROM `tbl_wilayah`
---
    public function JumlahWilayah()
    {
        return $this->db->table('tbl_wilayah')
            ->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_sekolah`
---
    public function JumlahSekolah()
    {
        return $this->db->table('tbl_sekolah')
            ->countAll();