app/Views/v_dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_sekolah`
WHERE `id_jenjang` = '1'
---
 <?php
    $db = \Config\Database::connect();
    foreach ($jenjang as $key => $value) {
        $jml = $db->table('tbl_sekolah')->where('id_jenjang', $value['id_jenjang'])->countAllResults();